mod4.3.1-flavours> module purge
mod4.3.1-flavours> module load gnu/9.1.0
mod4.3.1-flavours> module load simd/avx
mod4.3.1-flavours> module load bar/5.4
mod4.3.1-flavours> module list
Currently Loaded Modulefiles:
 1) gnu/9.1.0   2) simd/avx   3) bar/5.4  
mod4.3.1-flavours> bar
bar 5.4 (gcc/9.1.0, avx)
mod4.3.1-flavours> module switch simd simd/avx2
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 84: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 85: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 86: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 87: WRAPPER:: command not found
mod4.3.1-flavours> module list
Currently Loaded Modulefiles:
 1) gnu/9.1.0   2) bar/5.4   3) simd/avx2  
mod4.3.1-flavours> bar
bar 5.4 (gcc/9.1.0, avx)
