mod4.3.1-flavours> module purge
mod4.3.1-flavours> module load pgi/18.4
mod4.3.1-flavours> module load openmpi/3.1
mod4.3.1-flavours> module load foo/1.1
mod4.3.1-flavours> module list
Currently Loaded Modulefiles:
 1) pgi/18.4   2) openmpi/3.1   3) foo/1.1  
mod4.3.1-flavours> foo
This is fake foo 1.1 (pgi/18.4, openmpi/3.1)
mod4.3.1-flavours> module switch pgi intel/2018
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 86: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 87: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 88: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 89: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 90: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 91: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 92: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 93: WRAPPER:: command not found
mod4.3.1-flavours> module list
Currently Loaded Modulefiles:
 1) openmpi/3.1   2) foo/1.1   3) intel/2018  
mod4.3.1-flavours> foo
This is fake foo 1.1 (pgi/18.4, openmpi/3.1)
mod4.3.1-flavours> mpirun
This is fake mpirun (openmpi/3.1, pgi/18.4)
mod4.3.1-flavours> module purge
Unloading foo/1.1
  Module ERROR: invalid command name "flavours"
    In
    '$MOD_GIT_ROOTDIR/doc/example/compiler-etc-dependencies/flavours/foo/1.1'
    Please contact <root@localhost>

Unloading openmpi/3.1
  Module ERROR: invalid command name "flavours"
    In
    '$MOD_GIT_ROOTDIR/doc/example/compiler-etc-dependencies/flavours/openmpi/3.1'
    Please contact <root@localhost>
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 86: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 87: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 88: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 89: WRAPPER:: command not found
mod4.3.1-flavours> module load intel/2019
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 86: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 87: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 88: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 89: WRAPPER:: command not found
mod4.3.1-flavours> module load foo
foo/2.4 conflicts with loaded module 'foo/1.1'

Loading foo/2.4
  ERROR: Module evaluation aborted
mod4.3.1-flavours> module list
Currently Loaded Modulefiles:
 1) openmpi/3.1   2) foo/1.1   3) intel/2019  
mod4.3.1-flavours> foo
This is fake foo 1.1 (pgi/18.4, openmpi/3.1)
mod4.3.1-flavours> module load openmpi
openmpi/4.0 conflicts with loaded module 'openmpi/3.1'

Loading openmpi/4.0
  ERROR: Module evaluation aborted
mod4.3.1-flavours> module list
Currently Loaded Modulefiles:
 1) openmpi/3.1   2) foo/1.1   3) intel/2019  
mod4.3.1-flavours> foo
This is fake foo 1.1 (pgi/18.4, openmpi/3.1)
