mod4.3.1-flavours> module purge
mod4.3.1-flavours> module load pgi/19.4
mod4.3.1-flavours> module load openmpi
mod4.3.1-flavours> module list
Currently Loaded Modulefiles:
 1) pgi/19.4   2) openmpi/4.0  
mod4.3.1-flavours> mpirun
This is fake mpirun (openmpi/4.0, pgi/19.4)
mod4.3.1-flavours> module switch pgi intel/2019
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 86: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 87: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 88: WRAPPER:: command not found
/homes/payerle/modules/install/mod4.3.1-flavours/init/bash: line 89: WRAPPER:: command not found
mod4.3.1-flavours> module list
Currently Loaded Modulefiles:
 1) openmpi/4.0   2) intel/2019  
mod4.3.1-flavours> mpirun
This is fake mpirun (openmpi/4.0, pgi/19.4)
