mod3.2.10-flavours> module purge
mod3.2.10-flavours> module load pgi/18.4
mod3.2.10-flavours> module load openmpi/3.1
mod3.2.10-flavours> module load foo/1.1
mod3.2.10-flavours> module list
Currently Loaded Modulefiles:
  1) pgi/18.4      2) openmpi/3.1   3) foo/1.1
mod3.2.10-flavours> foo
This is fake foo 1.1 (pgi/18.4, openmpi/3.1)
mod3.2.10-flavours> module switch pgi intel/2018
mod3.2.10-flavours> module list
Currently Loaded Modulefiles:
  1) intel/2018    2) openmpi/3.1   3) foo/1.1
mod3.2.10-flavours> foo
This is fake foo 1.1 (intel/2018, openmpi/3.1)
mod3.2.10-flavours> mpirun
This is fake mpirun (openmpi/3.1, intel/2018)
mod3.2.10-flavours> module purge
mod3.2.10-flavours> module load intel/2019
mod3.2.10-flavours> module load foo
mod3.2.10-flavours> module list
Currently Loaded Modulefiles:
  1) intel/2019   2) foo/2.4
mod3.2.10-flavours> foo
This is fake foo 2.4 (intel/2019, nompi)
mod3.2.10-flavours> module load openmpi
mod3.2.10-flavours> module list
Currently Loaded Modulefiles:
  1) intel/2019    2) foo/2.4       3) openmpi/4.0
mod3.2.10-flavours> foo
This is fake foo 2.4 (intel/2019, openmpi/4.0)
